RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr6.c
/**
 *******************************************************************************
 * @file  hc32f4a0_tmr6.c
 * @brief This file provides firmware functions to manage the TMR6 (TMR6).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Wangmin         First version
   2020-07-15       Wangmin         Refine macro define
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a0_tmr6.h"
#include "hc32f4a0_utility.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_TMR6 TMR6
 * @brief TMR6 Driver Library
 * @{
 */

#if (DDL_TMR6_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup TMR6_Local_Macros TMR6 Local Macros
 * @{
 */

/* Timer6 registers reset value */
#define TMR6_REG_REFERENCE_RESET_VALUE_U32      (0xFFFFFFFFUL)
#define TMR6_REG_REFERENCE_RESET_VALUE_U16      (0xFFFFU)
#define TMR6_REG_GCONR_RESET_VALUE              (0x00000100UL)

/* Define for BCONR register configuration */
#define BCONR_REG_CFG_MSK                       (0x0000000FUL)
#define BCONR_GEN_BUF_CHA_OFFSET                (0x00UL)
#define BCONR_GEN_BUF_CHB_OFFSET                (0x04UL)
#define BCONR_PERIOD_BUF_OFFSET                 (0x08UL)
#define BCONR_SPECIAL_BUF_CHA_OFFSET            (0x10UL)
#define BCONR_SPECIAL_BUF_CHB_OFFSET            (0x14UL)

/* Define mask value for port output configuration for PCNAR/PCNBR register */
#define PCNA_BR_REG_OUTPUT_CFG_MASK             (0x9003FFFFUL)
#define PCNA_BR_REG_EMB_CFG_MASK                (TMR6_PCNAR_EMBSA | TMR6_PCNAR_EMBRA | TMR6_PCNAR_EMBCA)
/* Define mask value for GCONR register */
#define TMR6_INITIAL_MASK                       (TMR6_GCONR_DIR | TMR6_GCONR_MODE | TMR6_GCONR_CKDIV | TMR6_GCONR_OVSTP)
#define TMR6_ZMASK_CFG_MASK                     (TMR6_GCONR_ZMSKVAL | TMR6_GCONR_ZMSKPOS | TMR6_GCONR_ZMSKREV)

#define TMR6_HW_CTRL_EVENT_MASK  (TMR6_HW_CTRL_PWMA_RISING           |         \
                                  TMR6_HW_CTRL_PWMA_FAILLING         |         \
                                  TMR6_HW_CTRL_PWMB_RISING           |         \
                                  TMR6_HW_CTRL_PWMB_FAILLING         |         \
                                  TMR6_HW_CTRL_INTER_EVENT0          |         \
                                  TMR6_HW_CTRL_INTER_EVENT1          |         \
                                  TMR6_HW_CTRL_INTER_EVENT2          |         \
                                  TMR6_HW_CTRL_INTER_EVENT3          |         \
                                  TMR6_HW_CTRL_TRIGEA_RISING         |         \
                                  TMR6_HW_CTRL_TRIGEA_FAILLING       |         \
                                  TMR6_HW_CTRL_TRIGEB_RISING         |         \
                                  TMR6_HW_CTRL_TRIGEB_FAILLING       |         \
                                  TMR6_HW_CTRL_TRIGEC_RISING         |         \
                                  TMR6_HW_CTRL_TRIGEC_FAILLING       |         \
                                  TMR6_HW_CTRL_TRIGED_RISING         |         \
                                  TMR6_HW_CTRL_TRIGED_FAILLING)

#define TMR6_HW_CNT_EVENT_MASK   (TMR6_HW_CNT_PWMAL_PWMBRISING       |         \
                                  TMR6_HW_CNT_PWMAL_PWMBFAILLING     |         \
                                  TMR6_HW_CNT_PWMAH_PWMBRISING       |         \
                                  TMR6_HW_CNT_PWMAH_PWMBFAILLING     |         \
                                  TMR6_HW_CNT_PWMBL_PWMARISING       |         \
                                  TMR6_HW_CNT_PWMBL_PWMAFAILLING     |         \
                                  TMR6_HW_CNT_PWMBH_PWMARISING       |         \
                                  TMR6_HW_CNT_PWMBH_PWMAFAILLING     |         \
                                  TMR6_HW_CNT_INTER_EVENT0           |         \
                                  TMR6_HW_CNT_INTER_EVENT1           |         \
                                  TMR6_HW_CNT_INTER_EVENT2           |         \
                                  TMR6_HW_CNT_INTER_EVENT3           |         \
                                  TMR6_HW_CNT_TRIGEA_RISING          |         \
                                  TMR6_HW_CNT_TRIGEA_FAILLING        |         \
                                  TMR6_HW_CNT_TRIGEB_RISING          |         \
                                  TMR6_HW_CNT_TRIGEB_FAILLING        |         \
                                  TMR6_HW_CNT_TRIGEC_RISING          |         \
                                  TMR6_HW_CNT_TRIGEC_FAILLING        |         \
                                  TMR6_HW_CNT_TRIGED_RISING          |         \
                                  TMR6_HW_CNT_TRIGED_FAILLING)

#define TMR6_IRQ_EN_MASK       (TMR6_IRQ_EN_CNT_MATCH_A           |            \
                                TMR6_IRQ_EN_CNT_MATCH_B           |            \
                                TMR6_IRQ_EN_CNT_MATCH_C           |            \
                                TMR6_IRQ_EN_CNT_MATCH_D           |            \
                                TMR6_IRQ_EN_CNT_MATCH_E           |            \
                                TMR6_IRQ_EN_CNT_MATCH_F           |            \
                                TMR6_IRQ_EN_OVERFLOW              |            \
                                TMR6_IRQ_EN_UNDERFLOW             |            \
                                TMR6_IRQ_EN_DEAD_TIME_ERR         |            \
                                TMR6_IRQ_EN_UPCNT_SP_MATCH_A      |            \
                                TMR6_IRQ_EN_DOWNCNT_SP_MATCH_A    |            \
                                TMR6_IRQ_EN_UPCNT_SP_MATCH_B      |            \
                                TMR6_IRQ_EN_DOWNCNT_SP_MATCH_B)

#define TMR6_STAT_FLAG_MASK    (TMR6_STAT_CNT_MATCH_A             |            \
                                TMR6_STAT_CNT_MATCH_B             |            \
                                TMR6_STAT_CNT_MATCH_C             |            \
                                TMR6_STAT_CNT_MATCH_D             |            \
                                TMR6_STAT_CNT_MATCH_E             |            \
                                TMR6_STAT_CNT_MATCH_F             |            \
                                TMR6_STAT_OVERFLOW                |            \
                                TMR6_STAT_UNDERFLOW               |            \
                                TMR6_STAT_DEAD_TIME_ERR           |            \
                                TMR6_STAT_UPCNT_SP_MATCH_A        |            \
                                TMR6_STAT_DOWNCNT_SP_MATCH_A      |            \
                                TMR6_STAT_UPCNT_SP_MATCH_B        |            \
                                TMR6_STAT_DOWNCNT_SP_MATCH_B      |            \
                                TMR6_STAT_CNT_DIR)

#define TMR6_SW_CTRL_REG_MASK  (TMR6_SSTAR_SSTA1                  |            \
                                TMR6_SSTAR_SSTA2                  |            \
                                TMR6_SSTAR_SSTA3                  |            \
                                TMR6_SSTAR_SSTA4                  |            \
                                TMR6_SSTAR_SSTA5                  |            \
                                TMR6_SSTAR_SSTA6                  |            \
                                TMR6_SSTAR_SSTA7                  |            \
                                TMR6_SSTAR_SSTA8)




/**
 * @defgroup TMR6_Check_Parameters_Validity TMR6 Check Parameters Validity
 * @{
 */

/*! Parameter valid check for normal timer6 unit */
#define IS_VALID_TMR6_UNIT(__TMR6x__)                                          \
(   (M4_TMR6_1 == (__TMR6x__))                  ||                             \
    (M4_TMR6_2 == (__TMR6x__))                  ||                             \
    (M4_TMR6_3 == (__TMR6x__))                  ||                             \
    (M4_TMR6_4 == (__TMR6x__))                  ||                             \
    (M4_TMR6_5 == (__TMR6x__))                  ||                             \
    (M4_TMR6_6 == (__TMR6x__))                  ||                             \
    (M4_TMR6_7 == (__TMR6x__))                  ||                             \
    (M4_TMR6_8 == (__TMR6x__)))

