RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr6.c
/*! Parameter valid check for interrupt source configuration */
#define IS_VALID_IRQ_SOURCE_CONFIG(x)                                          \
(   ((x) != 0UL)                                     &&                        \
    (((x) | TMR6_IRQ_EN_MASK) == TMR6_IRQ_EN_MASK))

/*! Parameter valid check for status bit read */
#define IS_VALID_STABIT_GET(x)                                                 \
(   ((x) != 0UL)                          &&                                   \
    (((x) | TMR6_STAT_FLAG_MASK) == TMR6_STAT_FLAG_MASK))

/*! Parameter valid check for period register */
#define IS_VALID_PERIOD_REG(x)                                                 \
(   (TMR6_PERIOD_REG_A == (x))           ||                                    \
    (TMR6_PERIOD_REG_B == (x))           ||                                    \
    (TMR6_PERIOD_REG_C == (x)))

/*! Parameter valid check for general compare register */
#define IS_VALID_CMP_REG(x)                                                    \
(   (TMR6_CMP_REG_A == (x))              ||                                    \
    (TMR6_CMP_REG_B == (x))              ||                                    \
    (TMR6_CMP_REG_C == (x))              ||                                    \
    (TMR6_CMP_REG_D == (x))              ||                                    \
    (TMR6_CMP_REG_E == (x))              ||                                    \
    (TMR6_CMP_REG_F == (x)))

/*! Parameter valid check for general/special compare channel */
#define IS_VALID_CMP_CH(x)                                                     \
(   (TMR6_CH_A == (x))                   ||                                    \
    (TMR6_CH_B == (x)))

/*! Parameter valid check for buffer function status */
#define IS_VALID_BUF_STAT(x)                                                   \
(   (TMR6_BUF_FUNC_OFF == (x))           ||                                    \
    (TMR6_BUF_FUNC_ON == (x)))

/*! Parameter valid check for buffer function number */
#define IS_VALID_BUF_FUN_NUM(x)                                                \
(   (TMR6_BUF_FUNC_SINGLE == (x))        ||                                    \
    (TMR6_BUF_FUNC_DOUBLE == (x)))

/*! Parameter valid check for buffer transfer timer configuration */
#define IS_VALID_BUF_TRANS_TIM(x)                                              \
(   (TMR6_BUF_TRANS_TIM_NONE == (x))     ||                                    \
    (TMR6_BUF_TRANS_TIM_OVERFLOW == (x)) ||                                    \
    (TMR6_BUF_TRANS_TIM_UNDERFLOW == (x))||                                    \
    (TMR6_BUF_TRANS_TIM_BOTH == (x)))

/*! Parameter valid check for valid period function status for channel A */
#define IS_VALID_VALID_PERIOD_STAT_CHA(x)                                      \
(   (TMR6_VALID_PERIOD_FUNC_CHA_OFF == (x))   ||                               \
    (TMR6_VALID_PERIOD_FUNC_CHA_ON == (x)))

/*! Parameter valid check for valid period function status for channel B */
#define IS_VALID_VALID_PERIOD_STAT_CHB(x)                                      \
(   (TMR6_VALID_PERIOD_FUNC_CHB_OFF == (x))   ||                               \
    (TMR6_VALID_PERIOD_FUNC_CHB_ON == (x)))

/*! Parameter valid check for count condition for valid period function */
#define IS_VALID_PERIOD_CNT_COND(x)                                            \
(   (TMR6_VALID_PERIOD_FUNC_OFF == (x))             ||                         \
    (TMR6_VALID_PERIOD_CNT_COND_UNDERFLOW == (x))   ||                         \
    (TMR6_VALID_PERIOD_CNT_COND_OVERFLOW == (x))    ||                         \
    (TMR6_VALID_PERIOD_CNT_COND_BOTH == (x)))

/*! Parameter valid check for count condition for valid period count */
#define IS_VALID_PERIOD_CNT(x)                                                 \
(   (TMR6_VALID_PERIOD_CNT_INVALID == (x))          ||                         \
    (TMR6_VALID_PERIOD_CNT_1 == (x))                ||                         \
    (TMR6_VALID_PERIOD_CNT_2 == (x))                ||                         \
    (TMR6_VALID_PERIOD_CNT_3 == (x))                ||                         \
    (TMR6_VALID_PERIOD_CNT_4 == (x))                ||                         \
    (TMR6_VALID_PERIOD_CNT_5 == (x))                ||                         \
    (TMR6_VALID_PERIOD_CNT_6 == (x))                ||                         \
    (TMR6_VALID_PERIOD_CNT_7 == (x)))

/*! Parameter valid check for count register data range */
#define IS_VALID_REG_RANGE_U16(x)               ((x) <= 0xFFFFUL)

/*! Parameter valid check for dead time register */
#define IS_VALID_DEADTIME_REG(x)                                               \
(   (TMR6_DEADTIME_REG_UP_A == (x))             ||                             \
    (TMR6_DEADTIME_REG_DOWN_A == (x))           ||                             \
    (TMR6_DEADTIME_REG_UP_B == (x))             ||                             \
    (TMR6_DEADTIME_REG_DOWN_B == (x)))

/*! Parameter valid check for input port */
#define IS_VALID_INPUT_PORT(x)                                                 \
(   (TMR6_IO_PWMA == (x))                       ||                             \
    (TMR6_IO_PWMB == (x))                       ||                             \
    (TMR6_INPUT_TRIGA == (x))                   ||                             \
    (TMR6_INPUT_TRIGB == (x))                   ||                             \
    (TMR6_INPUT_TRIGC == (x))                   ||                             \
    (TMR6_INPUT_TRIGD == (x)))

/*! Parameter valid check for output port */
#define IS_VALID_OUTPUT_PORT(x)                                                \
(   (TMR6_IO_PWMA == (x))                       ||                             \
    (TMR6_IO_PWMB == (x)))

/*! Parameter valid check for input port filter clock */
#define IS_VALID_INPUT_FILTER_CLK(x)                                           \
(   (TMR6_INPUT_FILTER_PCLK0_DIV1 == (x))       ||                             \
    (TMR6_INPUT_FILTER_PCLK0_DIV4 == (x))       ||                             \
    (TMR6_INPUT_FILTER_PCLK0_DIV16 == (x))      ||                             \
    (TMR6_INPUT_FILTER_PCLK0_DIV64 == (x)))

