RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr6.c
/*! Parameter valid check for port function mode*/
#define IS_VALID_PORT_MODE_FUNC(x)                                             \
(   (TMR6_PORT_COMPARE_OUTPUT == (x))           ||                             \
    (TMR6_PORT_CAPTURE_INPUT == (x)))

/*! Parameter valid check for port input filter function status */
#define IS_VALID_PORT_INPUT_FILTER_STA(x)                                      \
(   (TMR6_PORT_INPUT_FILTER_OFF == (x))         ||                             \
    (TMR6_PORT_INPUT_FILTER_ON == (x)))

/*! Parameter valid check for output port status for count result  */
#define IS_VALID_OUTPUT_STA_RESULT(x)                                          \
(   (TMR6_PORT_OUTPUT_STA_LOW == (x))           ||                             \
    (TMR6_PORT_OUTPUT_STA_HIGH == (x))          ||                             \
    (TMR6_PORT_OUTPUT_STA_HOLD == (x))          ||                             \
    (TMR6_PORT_OUTPUT_STA_REVERSE == (x)))

/*! Parameter valid check for force output port status for count result  */
#define IS_VALID_FORCE_OUTPUT_STA_RESULT(x)                                    \
(   (TMR6_FORCE_PORT_OUTPUT_INVALID == (x))     ||                             \
    (TMR6_FORCE_PORT_OUTPUT_STA_LOW == (x))     ||                             \
    (TMR6_FORCE_PORT_OUTPUT_STA_HIGH == (x)))

/*! Parameter valid check for output port status for count status  */
#define IS_VALID_OUTPUT_STA_STA(x)                                             \
(   (TMR6_PORT_OUTPUT_STA_LOW == (x))           ||                             \
    (TMR6_PORT_OUTPUT_STA_HIGH == (x))          ||                             \
    (TMR6_PORT_OUTPUT_STA_HOLD == (x)))

/*! Parameter valid check for EMB event valid channel  */
#define IS_VALID_EMB_CH(x)                                                     \
(   (TMR6_EMB_EVENT_VALID_CH0 == (x))           ||                             \
    (TMR6_EMB_EVENT_VALID_CH1 == (x))           ||                             \
    (TMR6_EMB_EVENT_VALID_CH2 == (x))           ||                             \
    (TMR6_EMB_EVENT_VALID_CH3 == (x)))

/*! Parameter valid check for EMB release mode when EMB event invalid   */
#define IS_VALID_EMB_RELEASE_MODE(x)                                           \
(   (TMR6_EMB_RELEASE_IMMEDIATE == (x))         ||                             \
    (TMR6_EMB_RELEASE_OVERFLOW == (x))          ||                             \
    (TMR6_EMB_RELEASE_UNDERFLOW == (x))         ||                             \
    (TMR6_EMB_RELEASE_OVERFLOW_UNDERFLOW == (x)))

/*! Parameter valid check for port output status when EMB event valid */
#define IS_VALID_EMB_VALID_PORT_STA(x)                                         \
(   (TMR6_EMB_PORTSTA_NORMAL == (x))            ||                             \
    (TMR6_EMB_PORTSTA_HIZ == (x))               ||                             \
    (TMR6_EMB_PORTSTA_LOW == (x))               ||                             \
    (TMR6_EMB_PORTSTA_HIGH == (x)))

/*! Parameter valid check for dead time buffer function for DTUAR and DTUBR register */
#define IS_VALID_DEADTIME_BUF_FUNC_DTUAR_REG(x)                                \
(   (TMR6_DEADTIME_CNT_UP_BUF_OFF == (x))       ||                             \
    (TMR6_DEADTIME_CNT_UP_BUF_ON == (x)))

/*! Parameter valid check for dead time buffer function for DTDAR and DTDBR register */
#define IS_VALID_DEADTIME_BUF_FUNC_DTDAR_REG(x)                                \
(   (TMR6_DEADTIME_CNT_DOWN_BUF_OFF == (x))     ||                             \
    (TMR6_DEADTIME_CNT_DOWN_BUF_ON == (x)))

/*! Parameter valid check for dead time buffer transfer condition */
#define IS_VALID_DEADTIME_BUF_TRANS_COND_REG(x)                                \
(   (TMR6_DEADTIME_TRANS_COND_NONE == (x))      ||                             \
    (TMR6_DEADTIME_TRANS_COND_OVERFLOW == (x))  ||                             \
    (TMR6_DEADTIME_TRANS_COND_UNDERFLOW == (x)) ||                             \
    (TMR6_DEADTIME_TRANS_COND_BOTH == (x)))

/*! Parameter valid check for dead time equal function for DTUAR and DTDAR register */
#define IS_VALID_DEADTIME_EQUAL_FUNC_REG(x)                                    \
(   (TMR6_DEADTIME_EQUAL_OFF == (x))            ||                             \
    (TMR6_DEADTIME_EQUAL_ON == (x)))

/*! Parameter valid check for hardware control events   */
#define IS_VALID_HW_CTRL_EVENTS(x)                                             \
(   ((x) != 0UL)                                     &&                        \
    (((x) | TMR6_HW_CTRL_EVENT_MASK) == TMR6_HW_CTRL_EVENT_MASK))

/*! Parameter valid check for hardware count events   */
#define IS_VALID_HW_CNT_EVENTS(x)                                              \
(   ((x) != 0UL)                                     &&                        \
    (((x) | TMR6_HW_CNT_EVENT_MASK) == TMR6_HW_CNT_EVENT_MASK))

/*! Parameter valid check for count Mode */
#define IS_VALID_CNT_MODE(x)                                                   \
(   (TMR6_MODE_SAWTOOTH == (x))                 ||                             \
    (TMR6_MODE_TRIANGLE == (x)))

/*! Parameter valid check for count direction */
#define IS_VALID_CNT_DIRECTION(x)                                              \
(   (TMR6_CNT_INCREASE == (x))                  ||                             \
    (TMR6_CNT_DECREASE == (x)))

/*! Parameter valid check for count clock source  */
#define IS_VALID_CNT_CLK_SRC(x)                                                \
(   (TMR6_CLK_PCLK0_DIV1 == (x))                ||                             \
    (TMR6_CLK_PCLK0_DIV2 == (x))                ||                             \
    (TMR6_CLK_PCLK0_DIV4 == (x))                ||                             \
    (TMR6_CLK_PCLK0_DIV8 == (x))                ||                             \
    (TMR6_CLK_PCLK0_DIV16 == (x))               ||                             \
    (TMR6_CLK_PCLK0_DIV32 == (x))               ||                             \
    (TMR6_CLK_PCLK0_DIV64 == (x))               ||                             \
    (TMR6_CLK_PCLK0_DIV128 == (x))              ||                             \
    (TMR6_CLK_PCLK0_DIV256 == (x))              ||                             \
    (TMR6_CLK_PCLK0_DIV512 == (x))              ||                             \
    (TMR6_CLK_PCLK0_DIV1024 == (x)))

