RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr6.c
/*! Parameter valid check for stop when overflow mode */
#define IS_VALID_STOP_AFTER_OVF_MODE(x)                                        \
(   (TMR6_CNT_CONTINUOUS == (x))                ||                             \
    (TMR6_STOP_AFTER_OVF == (x)))

/*! Parameter valid check for Z Mask input function mask cycles number  */
#define IS_VALID_ZMASK_CYCLES(x)                                               \
(   (TMR6_ZMASK_CYCLE_FUNC_INVALID == (x))      ||                             \
    (TMR6_ZMASK_CYCLE_4 == (x))                 ||                             \
    (TMR6_ZMASK_CYCLE_8 == (x))                 ||                             \
    (TMR6_ZMASK_CYCLE_16 == (x)))

/*! Parameter valid check for Z Mask function of timer6 position unit */
#define IS_VALID_POS_UNIT_ZMASK_FUNC(x)                                        \
(   (TMR6_POS_CLR_ZMASK_FUNC_INVALID == (x))    ||                             \
    (TMR6_POS_CLR_ZMASK_FUNC_VALID == (x)))

/*! Parameter valid check for Z Mask function of timer6 revolution unit */
#define IS_VALID_REVO_UNIT_ZMASK_FUNC(x)                                       \
(   (TMR6_REVO_CNT_ZMASK_FUNC_INVALID == (x))   ||                             \
    (TMR6_REVO_CNT_ZMASK_FUNC_VALID == (x)))

/*! Parameter valid check for hardware trigger index  */
#define IS_VALID_HW_TRIGGER_INDEX(x)                                           \
(   (TMR6_HW_TRIG_0 == (x))                     ||                             \
    (TMR6_HW_TRIG_1 == (x))                     ||                             \
    (TMR6_HW_TRIG_2 == (x))                     ||                             \
    (TMR6_HW_TRIG_3 == (x)))

/*! Parameter valid check for software sync control unit configuration */
#define IS_VALID_SW_CTRL_CFG(x)                                                \
(   ((x) != 0UL)                                     &&                        \
    (((x) | TMR6_SW_CTRL_REG_MASK) == TMR6_SW_CTRL_REG_MASK))

/*! Parameter valid check for common trigger configuration. */
#define IS_VALID_TMR6_COM_TRIG(x)                                              \
(   ((x) != 0x00UL)                        &&                                  \
    (((x) | TMR6_COM_TRIG_MASK) == TMR6_COM_TRIG_MASK))

/* Unit check for TMR6 which data width is 32 bit */
#define IS_TMR6_32BIT_UINT(x)                                                  \
(   (M4_TMR6_1 == (x))                          ||                             \
    (M4_TMR6_2 == (x))                          ||                             \
    (M4_TMR6_3 == (x))                          ||                             \
    (M4_TMR6_4 == (x)))

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 * @defgroup TMR6_Global_Functions TMR6 Global Functions
 * @{
 */

/**
 * @brief  Timer6 interrupt request enable or disable
 * @param  [in] TMR6x            Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @param  [in] u32Tmr6Irq       Irq source,  Can be one or any combination of
 *                               the values from @ref TMR6_Interrupt_Enable_Bit_Define
 * @param  [in] enNewState       Disable or Enable the function
 * @retval None
 */
void TMR6_IntCmd(M4_TMR6_TypeDef *TMR6x, uint32_t u32Tmr6Irq, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));
    DDL_ASSERT(IS_VALID_IRQ_SOURCE_CONFIG(u32Tmr6Irq));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if(Enable == enNewState)
    {
        SET_REG32_BIT(TMR6x->ICONR, u32Tmr6Irq);
    }
    else
    {
        CLEAR_REG32_BIT(TMR6x->ICONR, u32Tmr6Irq);
    }
}

/**
 * @brief  Get Timer6 status flag
 * @param  [in] TMR6x           Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @param  [in] u32StaBit       Status bit to be read, Can be one or any combination of
 *                              the values from @ref TMR6_Sta_Bit_Get_Define
 * @retval An en_flag_status_t enumeration value.
 *  @arg Set:                   Status bit is set
 *  @arg Reset:                 Status bit is reset
 */
en_flag_status_t TMR6_GetSta(const M4_TMR6_TypeDef *TMR6x, uint32_t u32StaBit)
{
    en_flag_status_t enRet = Reset;
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));
    DDL_ASSERT(IS_VALID_STABIT_GET(u32StaBit));

    if(0UL != READ_REG32_BIT(TMR6x->STFLR, u32StaBit))
    {
        enRet =  Set;
    }
    return enRet;
}

/**
 * @brief  Get Timer6 period number when valid period function enable
 * @param  [in] TMR6x           Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @retval A uint32_t data for periods number
 */
uint32_t TMR6_GetPeriodNum(const M4_TMR6_TypeDef *TMR6x)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));

    return (READ_REG32_BIT(TMR6x->STFLR, TMR6_STFLR_VPERNUM) >> TMR6_STFLR_VPERNUM_POS);
}

/**
 * @brief  De-initialize the timer6 unit
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @retval None
 */
void TMR6_DeInit(M4_TMR6_TypeDef *TMR6x)
{
    uint32_t u32RefRegRstValue;
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));

