RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr6.c
    if(IS_TMR6_32BIT_UINT(TMR6x))
    {
        u32RefRegRstValue = TMR6_REG_REFERENCE_RESET_VALUE_U32;
    }
    else
    {
        u32RefRegRstValue = TMR6_REG_REFERENCE_RESET_VALUE_U16;
    }

    WRITE_REG32(TMR6x->GCONR, TMR6_REG_GCONR_RESET_VALUE);
    WRITE_REG32(TMR6x->CNTER, 0x00000000UL);
    WRITE_REG32(TMR6x->UPDAR, 0x00000000UL);
    WRITE_REG32(TMR6x->PERAR, u32RefRegRstValue);
    WRITE_REG32(TMR6x->PERBR, u32RefRegRstValue);
    WRITE_REG32(TMR6x->PERCR, u32RefRegRstValue);
    WRITE_REG32(TMR6x->GCMAR, u32RefRegRstValue);
    WRITE_REG32(TMR6x->GCMBR, u32RefRegRstValue);
    WRITE_REG32(TMR6x->GCMCR, u32RefRegRstValue);
    WRITE_REG32(TMR6x->GCMDR, u32RefRegRstValue);
    WRITE_REG32(TMR6x->GCMER, u32RefRegRstValue);
    WRITE_REG32(TMR6x->GCMFR, u32RefRegRstValue);
    WRITE_REG32(TMR6x->SCMAR, u32RefRegRstValue);
    WRITE_REG32(TMR6x->SCMBR, u32RefRegRstValue);
    WRITE_REG32(TMR6x->SCMCR, u32RefRegRstValue);
    WRITE_REG32(TMR6x->SCMDR, u32RefRegRstValue);
    WRITE_REG32(TMR6x->SCMER, u32RefRegRstValue);
    WRITE_REG32(TMR6x->SCMFR, u32RefRegRstValue);
    WRITE_REG32(TMR6x->DTUAR, u32RefRegRstValue);
    WRITE_REG32(TMR6x->DTDAR, u32RefRegRstValue);
    WRITE_REG32(TMR6x->DTUBR, u32RefRegRstValue);
    WRITE_REG32(TMR6x->DTDBR, u32RefRegRstValue);
    WRITE_REG32(TMR6x->ICONR, 0x00000000UL);
    WRITE_REG32(TMR6x->BCONR, 0x00000000UL);
    WRITE_REG32(TMR6x->DCONR, 0x00000000UL);
    WRITE_REG32(TMR6x->PCNAR, 0x00000000UL);
    WRITE_REG32(TMR6x->PCNBR, 0x00000000UL);
    WRITE_REG32(TMR6x->FCNGR, 0x00000000UL);
    WRITE_REG32(TMR6x->VPERR, 0x00000000UL);
    WRITE_REG32(TMR6x->STFLR, 0x00000000UL);
    WRITE_REG32(TMR6x->HSTAR, 0x00000000UL);
    WRITE_REG32(TMR6x->HSTPR, 0x00000000UL);
    WRITE_REG32(TMR6x->HCLRR, 0x00000000UL);
    WRITE_REG32(TMR6x->HUPDR, 0x00000000UL);
    WRITE_REG32(TMR6x->HCPAR, 0x00000000UL);
    WRITE_REG32(TMR6x->HCPBR, 0x00000000UL);
    WRITE_REG32(TMR6x->HCUPR, 0x00000000UL);
    WRITE_REG32(TMR6x->HCDOR, 0x00000000UL);
}

/**
 * @brief  Initialize the timer6 unit
 * @param  [in] TMR6x                      Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @param  [in] pstcTmr6BaseCntCfg         Pointer of configuration structure
 * @retval An en_result_t enumeration value.
 *  @arg Ok:                               Successfully done
 *  @arg ErrorInvalidParameter:            Parameter error
 */
en_result_t TMR6_Init(M4_TMR6_TypeDef *TMR6x, const stc_tmr6_basecnt_cfg_t* pstcTmr6BaseCntCfg)
{
    en_result_t enRet = ErrorInvalidParameter;
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));

    if(NULL != pstcTmr6BaseCntCfg)
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_CNT_MODE(pstcTmr6BaseCntCfg->u32CntMode));
        DDL_ASSERT(IS_VALID_CNT_DIRECTION(pstcTmr6BaseCntCfg->u32CntDir));
        DDL_ASSERT(IS_VALID_CNT_CLK_SRC(pstcTmr6BaseCntCfg->u32CntClkDiv));
        DDL_ASSERT(IS_VALID_STOP_AFTER_OVF_MODE(pstcTmr6BaseCntCfg->u32CntStpAftOvf));

        MODIFY_REG32(TMR6x->GCONR,
                    TMR6_INITIAL_MASK,
                    (pstcTmr6BaseCntCfg->u32CntMode      \
                    | pstcTmr6BaseCntCfg->u32CntDir      \
                    | pstcTmr6BaseCntCfg->u32CntClkDiv   \
                    | pstcTmr6BaseCntCfg->u32CntStpAftOvf));
        enRet = Ok;
    }
    return enRet;
}

/**
 * @brief  Timer6 unit Z phase input mask config
 * @param  [in] TMR6x                      Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @param  [in] pstcTmr6ZMaskCfg           Pointer of configuration structure
 * @retval An en_result_t enumeration value.
 *  @arg Ok:                               Successfully done
 *  @arg ErrorInvalidParameter:            Parameter error
 */
en_result_t TMR6_ZMaskCfg(M4_TMR6_TypeDef *TMR6x, const stc_tmr6_zmask_cfg_t* pstcTmr6ZMaskCfg)
{
    en_result_t enRet = ErrorInvalidParameter;
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));

    if(NULL != pstcTmr6ZMaskCfg)
    {
        DDL_ASSERT(IS_VALID_ZMASK_CYCLES(pstcTmr6ZMaskCfg->u32ZMaskCycle));
        DDL_ASSERT(IS_VALID_POS_UNIT_ZMASK_FUNC(pstcTmr6ZMaskCfg->u32PosCntMaskEn));
        DDL_ASSERT(IS_VALID_REVO_UNIT_ZMASK_FUNC(pstcTmr6ZMaskCfg->u32RevCntMaskEn));

        MODIFY_REG32(TMR6x->GCONR,
                    TMR6_ZMASK_CFG_MASK,
                    pstcTmr6ZMaskCfg->u32ZMaskCycle | pstcTmr6ZMaskCfg->u32PosCntMaskEn | pstcTmr6ZMaskCfg->u32RevCntMaskEn);

        enRet = Ok;
    }
    return enRet;
}

/**
 * @brief  Timer6 counter function command
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @param  [in] enNewState  Disable or Enable the function
 * @retval None
 */
void TMR6_CountCmd(M4_TMR6_TypeDef *TMR6x, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if(Enable == enNewState)
    {
        SET_REG32_BIT(TMR6x->GCONR, TMR6_GCONR_START);
    }
    else
    {
        CLEAR_REG32_BIT(TMR6x->GCONR, TMR6_GCONR_START);
    }
}

/**
 * @brief  Timer6 counter register set
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @param  [in] u32Value    Counter value
 * @retval None
 */
void TMR6_SetCntReg(M4_TMR6_TypeDef *TMR6x, uint32_t u32Value)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));

    if(IS_TMR6_32BIT_UINT(TMR6x))
    {
        WRITE_REG32(TMR6x->CNTER, u32Value);
    }
    else
    {
        DDL_ASSERT(IS_VALID_REG_RANGE_U16(u32Value));
        WRITE_REG16(TMR6x->CNTER, u32Value);
    }

