RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr6.c
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Timer6 valid period function configuration for special compare function
 * @param  [in] TMR6x               Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @param  [in] pstcValidPeriodCfg  Pointer of configuration structure
 * @retval An en_result_t enumeration value.
 *  @arg Ok:                        Successfully done
 *  @arg ErrorInvalidParameter:     Parameter error
 */
en_result_t TMR6_ValidPeriodCfg(M4_TMR6_TypeDef *TMR6x, const stc_tmr6_valid_period_func_cfg_t* pstcValidPeriodCfg)
{
    en_result_t enRet = ErrorInvalidParameter;
    if(NULL != pstcValidPeriodCfg)
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));

        DDL_ASSERT(IS_VALID_VALID_PERIOD_STAT_CHA(pstcValidPeriodCfg->u32StatChA));
        DDL_ASSERT(IS_VALID_VALID_PERIOD_STAT_CHB(pstcValidPeriodCfg->u32StatChB));
        DDL_ASSERT(IS_VALID_PERIOD_CNT_COND(pstcValidPeriodCfg->u32CntCond));
        DDL_ASSERT(IS_VALID_PERIOD_CNT(pstcValidPeriodCfg->u32PeriodInterval));

        WRITE_REG32(TMR6x->VPERR, pstcValidPeriodCfg->u32StatChA |
                                    pstcValidPeriodCfg->u32StatChB |
                                    pstcValidPeriodCfg->u32CntCond |
                                    pstcValidPeriodCfg->u32PeriodInterval);

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Port input configuration(Trig)
 * @param  [in]  TMR6x                  Timer6 unit
 * @param  [in]  u32PortSel             Input port to be configured
 *  @arg  TMR6_IO_PWMA
 *  @arg  TMR6_IO_PWMB
 *  @arg  TMR6_INPUT_TRIGA
 *  @arg  TMR6_INPUT_TRIGB
 *  @arg  TMR6_INPUT_TRIGC
 *  @arg  TMR6_INPUT_TRIGD
 * @param  [in]  pstcTmr6PortInputCfg   Point Input Config Pointer
 * @retval An en_result_t enumeration value.
 *  @arg Ok:                            Successfully done
 *  @arg ErrorInvalidParameter:         Parameter error
 */
en_result_t TMR6_PortInputConfig(M4_TMR6_TypeDef *TMR6x,
                                    uint32_t u32PortSel,
                                    const stc_tmr6_port_input_cfg_t* pstcTmr6PortInputCfg)
{
    en_result_t enRet = ErrorInvalidParameter;

    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));

    if (NULL != pstcTmr6PortInputCfg)
    {
        DDL_ASSERT(IS_VALID_INPUT_PORT(u32PortSel));
        DDL_ASSERT(IS_VALID_PORT_MODE_FUNC(pstcTmr6PortInputCfg->u32PortMode));
        DDL_ASSERT(IS_VALID_PORT_INPUT_FILTER_STA(pstcTmr6PortInputCfg->u32FilterSta));
        DDL_ASSERT(IS_VALID_INPUT_FILTER_CLK(pstcTmr6PortInputCfg->u32FltClk));

        enRet = Ok;
        switch (u32PortSel)
        {
            case TMR6_IO_PWMA:
                MODIFY_REG32(TMR6x->PCNAR,
                             TMR6_PCNAR_CAPMDA,
                             pstcTmr6PortInputCfg->u32PortMode);
                MODIFY_REG32(TMR6x->FCNGR,
                             TMR6_FCNGR_NOFIENGA | TMR6_FCNGR_NOFICKGA,
                             pstcTmr6PortInputCfg->u32FilterSta<<TMR6_FCNGR_NOFIENGA_POS
                               | pstcTmr6PortInputCfg->u32FltClk<<TMR6_FCNGR_NOFICKGA_POS);
                break;

            case TMR6_IO_PWMB:
                MODIFY_REG32(TMR6x->PCNBR,
                             TMR6_PCNBR_CAPMDB,
                             pstcTmr6PortInputCfg->u32PortMode);
                MODIFY_REG32(TMR6x->FCNGR,
                             TMR6_FCNGR_NOFIENGB | TMR6_FCNGR_NOFICKGB,
                             pstcTmr6PortInputCfg->u32FilterSta<<TMR6_FCNGR_NOFIENGB_POS
                               | pstcTmr6PortInputCfg->u32FltClk<<TMR6_FCNGR_NOFICKGB_POS);
                break;

            case TMR6_INPUT_TRIGA:
                MODIFY_REG32(M4_TMR6_1->FCNTR,
                             TMR6_FCNTR_NOFIENTA | TMR6_FCNTR_NOFICKTA,
                             pstcTmr6PortInputCfg->u32FilterSta<<TMR6_FCNTR_NOFIENTA_POS
                               | pstcTmr6PortInputCfg->u32FltClk<<TMR6_FCNTR_NOFICKTA_POS);
                break;

            case TMR6_INPUT_TRIGB:
                MODIFY_REG32(M4_TMR6_1->FCNTR,
                             TMR6_FCNTR_NOFIENTB | TMR6_FCNTR_NOFICKTB,
                             pstcTmr6PortInputCfg->u32FilterSta<<TMR6_FCNTR_NOFIENTB_POS
                               | pstcTmr6PortInputCfg->u32FltClk<<TMR6_FCNTR_NOFICKTB_POS);
                break;

            case TMR6_INPUT_TRIGC:
                MODIFY_REG32(M4_TMR6_1->FCNTR,
                             TMR6_FCNTR_NOFIENTC | TMR6_FCNTR_NOFICKTC,
                             pstcTmr6PortInputCfg->u32FilterSta<<TMR6_FCNTR_NOFIENTC_POS
                               | pstcTmr6PortInputCfg->u32FltClk<<TMR6_FCNTR_NOFICKTC_POS);
                break;

            case TMR6_INPUT_TRIGD:
                MODIFY_REG32(M4_TMR6_1->FCNTR,
                             TMR6_FCNTR_NOFIENTD | TMR6_FCNTR_NOFICKTD,
                             pstcTmr6PortInputCfg->u32FilterSta<<TMR6_FCNTR_NOFIENTD_POS
                               | pstcTmr6PortInputCfg->u32FltClk<<TMR6_FCNTR_NOFICKTD_POS);
                break;

            default:
                enRet = ErrorInvalidParameter;
                break;
        }
    }
    return enRet;

}

/**
 * @brief  Port output configuration(Trig)
 * @param  [in]  TMR6x                  Timer6 unit
 * @param  [in]  u32PortSel             Output port to be configured
 *  @arg  TMR6_IO_PWMA
 *  @arg  TMR6_IO_PWMB
 * @param  [in]  pstcTmr6PortOutputCfg  Point Output Config Pointer
 * @retval An en_result_t enumeration value.
 *  @arg Ok:                        Successfully done
 *  @arg ErrorInvalidParameter:     Parameter error
 */
en_result_t TMR6_PortOutputConfig(M4_TMR6_TypeDef *TMR6x,
                                    uint32_t u32PortSel,
                                    const stc_tmr6_port_output_cfg_t* pstcTmr6PortOutputCfg)
{
    en_result_t enRet = ErrorInvalidParameter;

