RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr6.c
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));

    if (NULL != pstcTmr6PortOutputCfg)
    {
        DDL_ASSERT(IS_VALID_OUTPUT_PORT(u32PortSel));
        DDL_ASSERT(IS_VALID_PORT_MODE_FUNC(pstcTmr6PortOutputCfg->u32PortMode));
        DDL_ASSERT(IS_VALID_FORCE_OUTPUT_STA_RESULT(pstcTmr6PortOutputCfg->u32NextPeriodForceSta));
        DDL_ASSERT(IS_VALID_OUTPUT_STA_RESULT(pstcTmr6PortOutputCfg->u32DownCntMatchAnotherCmpRegSta));
        DDL_ASSERT(IS_VALID_OUTPUT_STA_RESULT(pstcTmr6PortOutputCfg->u32UpCntMatchAnotherCmpRegSta));
        DDL_ASSERT(IS_VALID_OUTPUT_STA_RESULT(pstcTmr6PortOutputCfg->u32DownCntMatchCmpRegSta));
        DDL_ASSERT(IS_VALID_OUTPUT_STA_RESULT(pstcTmr6PortOutputCfg->u32UpCntMatchCmpRegSta));
        DDL_ASSERT(IS_VALID_OUTPUT_STA_RESULT(pstcTmr6PortOutputCfg->u32UnderflowSta));
        DDL_ASSERT(IS_VALID_OUTPUT_STA_RESULT(pstcTmr6PortOutputCfg->u32OverflowSta));

        DDL_ASSERT(IS_VALID_OUTPUT_STA_STA(pstcTmr6PortOutputCfg->u32StopSta));
        DDL_ASSERT(IS_VALID_OUTPUT_STA_STA(pstcTmr6PortOutputCfg->u32StartSta));

        if(TMR6_IO_PWMA == u32PortSel)
        {
            MODIFY_REG32(TMR6x->PCNAR,
                         PCNA_BR_REG_OUTPUT_CFG_MASK,
                         pstcTmr6PortOutputCfg->u32PortMode | TMR6_PCNAR_OUTENA
                         | pstcTmr6PortOutputCfg->u32NextPeriodForceSta << TMR6_PCNAR_FORCA_POS
                         | pstcTmr6PortOutputCfg->u32DownCntMatchAnotherCmpRegSta << TMR6_PCNAR_CMBDCA_POS
                         | pstcTmr6PortOutputCfg->u32UpCntMatchAnotherCmpRegSta << TMR6_PCNAR_CMBUCA_POS
                         | pstcTmr6PortOutputCfg->u32DownCntMatchCmpRegSta << TMR6_PCNAR_CMADCA_POS
                         | pstcTmr6PortOutputCfg->u32UpCntMatchCmpRegSta << TMR6_PCNAR_CMAUCA_POS
                         | pstcTmr6PortOutputCfg->u32UnderflowSta << TMR6_PCNAR_UDFCA_POS
                         | pstcTmr6PortOutputCfg->u32OverflowSta << TMR6_PCNAR_OVFCA_POS
                         | pstcTmr6PortOutputCfg->u32StopSta << TMR6_PCNAR_STPCA_POS
                         | pstcTmr6PortOutputCfg->u32StartSta << TMR6_PCNAR_STACA_POS);
        }
        else
        {
            MODIFY_REG32(TMR6x->PCNBR,
                         PCNA_BR_REG_OUTPUT_CFG_MASK,
                         pstcTmr6PortOutputCfg->u32PortMode | TMR6_PCNBR_OUTENB
                         | pstcTmr6PortOutputCfg->u32NextPeriodForceSta << TMR6_PCNBR_FORCB_POS
                         | pstcTmr6PortOutputCfg->u32DownCntMatchAnotherCmpRegSta << TMR6_PCNBR_CMADCB_POS
                         | pstcTmr6PortOutputCfg->u32UpCntMatchAnotherCmpRegSta << TMR6_PCNBR_CMAUCB_POS
                         | pstcTmr6PortOutputCfg->u32DownCntMatchCmpRegSta << TMR6_PCNBR_CMBDCB_POS
                         | pstcTmr6PortOutputCfg->u32UpCntMatchCmpRegSta << TMR6_PCNBR_CMBUCB_POS
                         | pstcTmr6PortOutputCfg->u32UnderflowSta << TMR6_PCNBR_UDFCB_POS
                         | pstcTmr6PortOutputCfg->u32OverflowSta << TMR6_PCNBR_OVFCB_POS
                         | pstcTmr6PortOutputCfg->u32StopSta << TMR6_PCNBR_STPCB_POS
                         | pstcTmr6PortOutputCfg->u32StartSta << TMR6_PCNBR_STACB_POS);
        }
        enRet = Ok;
    }
    return enRet;
}

/**
 * @brief  EMB function configuration
 * @param  [in]  TMR6x              Timer6 unit
 * @param  [in]  u32PortSel         Output port to be configured
 *  @arg  TMR6_IO_PWMA
 *  @arg  TMR6_IO_PWMB
 * @param  [in]  pstcTmr6EmbCfg     Point EMB function Config Pointer
 * @retval An en_result_t enumeration value.
 *  @arg Ok:                        Successfully done
 *  @arg ErrorInvalidParameter:     Parameter error
 */
en_result_t TMR6_EMBConfig(M4_TMR6_TypeDef *TMR6x,
                           uint32_t u32PortSel,
                           const stc_tmr6_emb_cfg_t* pstcTmr6EmbCfg)
{
    __IO uint32_t *PCNXR;
    en_result_t enRet = ErrorInvalidParameter;

    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));

    if (NULL != pstcTmr6EmbCfg)
    {
        DDL_ASSERT(IS_VALID_OUTPUT_PORT(u32PortSel));
        DDL_ASSERT(IS_VALID_EMB_CH(pstcTmr6EmbCfg->u32ValidCh));
        DDL_ASSERT(IS_VALID_EMB_RELEASE_MODE(pstcTmr6EmbCfg->u32ReleaseMode));
        DDL_ASSERT(IS_VALID_EMB_VALID_PORT_STA(pstcTmr6EmbCfg->u32PortSta));

        if(TMR6_IO_PWMA == u32PortSel)
        {
            PCNXR = (__IO uint32_t*)&TMR6x->PCNAR;
        }
        else
        {
            PCNXR = (__IO uint32_t*)&TMR6x->PCNBR;
        }

        MODIFY_REG32(*PCNXR,
                      PCNA_BR_REG_EMB_CFG_MASK,
                      pstcTmr6EmbCfg->u32ValidCh
                      | pstcTmr6EmbCfg->u32ReleaseMode
                      | pstcTmr6EmbCfg->u32PortSta );

        enRet = Ok;
    }
    return enRet;

}

/**
 * @brief  Timer6 dead time function command
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @param  [in] enNewState  Disable or Enable the function
 * @retval None
 */
void TMR6_DeadTimeFuncCmd(M4_TMR6_TypeDef *TMR6x, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if(Enable == enNewState)
    {
        SET_REG32_BIT(TMR6x->DCONR, TMR6_DCONR_DTCEN);
    }
    else
    {
        CLEAR_REG32_BIT(TMR6x->DCONR, TMR6_DCONR_DTCEN);
    }
}

/**
 * @brief  DeadTime function configuration
 * @param  [in]  TMR6x              Timer6 unit
 * @param  [in]  pstcTmr6DTCfg      Timer6 dead time config pointer
 * @retval An en_result_t enumeration value.
 *  @arg Ok:                        Successfully done
 *  @arg ErrorInvalidParameter:     Parameter error
 */
en_result_t TMR6_DeadTimeCfg(M4_TMR6_TypeDef *TMR6x, const stc_tmr6_deadtime_cfg_t* pstcTmr6DTCfg)
{
    en_result_t enRet = ErrorInvalidParameter;

    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));

    if (NULL != pstcTmr6DTCfg)
    {
        DDL_ASSERT(IS_VALID_DEADTIME_EQUAL_FUNC_REG(pstcTmr6DTCfg->u32DtEqualUpDwn));
        DDL_ASSERT(IS_VALID_DEADTIME_BUF_FUNC_DTUAR_REG(pstcTmr6DTCfg->u32EnDtBufUp));
        DDL_ASSERT(IS_VALID_DEADTIME_BUF_FUNC_DTDAR_REG(pstcTmr6DTCfg->u32EnDtBufDwn));
        DDL_ASSERT(IS_VALID_DEADTIME_BUF_TRANS_COND_REG(pstcTmr6DTCfg->u32DtUpdCond));

        WRITE_REG32(TMR6x->DCONR, pstcTmr6DTCfg->u32DtEqualUpDwn
                                    | pstcTmr6DTCfg->u32EnDtBufUp
                                    | pstcTmr6DTCfg->u32EnDtBufDwn
                                    | pstcTmr6DTCfg->u32DtUpdCond);
        enRet = Ok;
    }
    return enRet;
}

/**
 * @brief  Software Sync Start
 * @param  [in]  u32UnitCombine  Software Sync units, This parameter can
 *                               be one or any combination of the parameter
 *                               @ref TMR6_Soft_Sync_Ctrl_Unit_Number_define
 * @retval None
 */
void TMR6_SwSyncStart(uint32_t u32UnitCombine)
{
    DDL_ASSERT(IS_VALID_SW_CTRL_CFG(u32UnitCombine));
    WRITE_REG32(M4_TMR6_1->SSTAR, u32UnitCombine);
}

/**
 * @brief  Software Sync Stop
 * @param  [in]  u32UnitCombine  Software Sync units, This parameter can
 *                               be one or any combination of the parameter
 *                               @ref TMR6_Soft_Sync_Ctrl_Unit_Number_define
 * @retval None
 */
void TMR6_SwSyncStop(uint32_t u32UnitCombine)
{
    DDL_ASSERT(IS_VALID_SW_CTRL_CFG(u32UnitCombine));
    WRITE_REG32(M4_TMR6_1->SSTPR, u32UnitCombine);
}

/**
 * @brief  Software Sync clear
 * @param  [in]  u32UnitCombine  Software Sync units, This parameter can
 *                               be one or any combination of the parameter
 *                               @ref TMR6_Soft_Sync_Ctrl_Unit_Number_define
 * @retval None
 */
void TMR6_SwSyncClr(uint32_t u32UnitCombine)
{
    DDL_ASSERT(IS_VALID_SW_CTRL_CFG(u32UnitCombine));
    WRITE_REG32(M4_TMR6_1->SCLRR, u32UnitCombine);
}

/**
 * @brief  Software Sync update
 * @param  [in]  u32UnitCombine  Software Sync units, This parameter can
 *                               be one or any combination of the parameter
 *                               @ref TMR6_Soft_Sync_Ctrl_Unit_Number_define
 * @retval None
 */
void TMR6_SwSyncUpdate(uint32_t u32UnitCombine)
{
    DDL_ASSERT(IS_VALID_SW_CTRL_CFG(u32UnitCombine));
    WRITE_REG32(M4_TMR6_1->SUPDR, u32UnitCombine);
}

/**
 * @brief  Hardware start function command
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @param  [in] enNewState  Disable or Enable the function
 * @retval None
 */
void TMR6_HwStartFuncCmd(M4_TMR6_TypeDef *TMR6x, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    MODIFY_REG32(TMR6x->HSTAR, TMR6_HSTAR_STAS, (uint32_t)enNewState << TMR6_HSTAR_STAS_POS);
}

/**
 * @brief  Hardware stop function command
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @param  [in] enNewState  Disable or Enable the function
 * @retval None
 */
void TMR6_HwStopFuncCmd(M4_TMR6_TypeDef *TMR6x, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    MODIFY_REG32(TMR6x->HSTPR, TMR6_HSTPR_STPS, (uint32_t)enNewState << TMR6_HSTPR_STPS_POS);
}

/**
 * @brief  Hardware clear function command
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @param  [in] enNewState  Disable or Enable the function
 * @retval None
 */
void TMR6_HwClrFuncCmd(M4_TMR6_TypeDef *TMR6x, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

