RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr6.c
    MODIFY_REG32(TMR6x->HCLRR, TMR6_HCLRR_CLES, (uint32_t)enNewState << TMR6_HCLRR_CLES_POS);
}

/**
 * @brief  Hardware update function command
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @param  [in] enNewState  Disable or Enable the function
 *
 * @retval None
 */
void TMR6_HwUpdateFuncCmd(M4_TMR6_TypeDef *TMR6x, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    MODIFY_REG32(TMR6x->HUPDR, TMR6_HUPDR_UPDS, (uint32_t)enNewState << TMR6_HUPDR_UPDS_POS);
}

/**
 * @brief  Hardware start condtion command
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @param  [in] u32CondSrc  Events source for hardware start, maybe one or any combination of the parameter
 *                          @ref TMR6_hardware_control_event_define
 * @param  [in] enNewState  The function new state
 *  @arg  This parameter can be: Enable or Disable
 * @retval None
 */
void TMR6_HwStartCondCmd(M4_TMR6_TypeDef *TMR6x,
                            uint32_t u32CondSrc,
                            en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));
    DDL_ASSERT(IS_VALID_HW_CTRL_EVENTS(u32CondSrc));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Enable == enNewState)
    {
        SET_REG32_BIT(TMR6x->HSTAR, u32CondSrc);
    }
    else
    {
        CLEAR_REG32_BIT(TMR6x->HSTAR, u32CondSrc);
    }
}

/**
 * @brief  Hardware start condition clear
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @retval None
 */
void TMR6_HwStartCondClr(M4_TMR6_TypeDef *TMR6x)
{
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));

    WRITE_REG32(TMR6x->HSTAR, 0UL);
}

/**
 * @brief  Hardware stop condtion command
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @param  [in] u32CondSrc  Events source for hardware stop, maybe one or any combination of the parameter
 *                          @ref TMR6_hardware_control_event_define
 * @param  [in] enNewState  The function new state
 *  @arg  This parameter can be: Enable or Disable
 * @retval None
 */
void TMR6_HwStopCondCmd(M4_TMR6_TypeDef *TMR6x,
                            uint32_t u32CondSrc,
                            en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));
    DDL_ASSERT(IS_VALID_HW_CTRL_EVENTS(u32CondSrc));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Enable == enNewState)
    {
        SET_REG32_BIT(TMR6x->HSTPR, u32CondSrc);
    }
    else
    {
        CLEAR_REG32_BIT(TMR6x->HSTPR, u32CondSrc);
    }
}

/**
 * @brief  Hardware stop condtion clear
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @retval None
 */
void TMR6_HwStopCondClr(M4_TMR6_TypeDef *TMR6x)
{
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));

    WRITE_REG32(TMR6x->HSTPR, 0UL);
}

/**
 * @brief  Hardware clear condtion command
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @param  [in] u32CondSrc  Events source for hardware clear, maybe one or any combination of the parameter
 *                          @ref TMR6_hardware_control_event_define
 * @param  [in] enNewState  The function new state
 *  @arg  This parameter can be: Enable or Disable
 * @retval None
 */
void TMR6_HwClrCondCmd(M4_TMR6_TypeDef *TMR6x,
                            uint32_t u32CondSrc,
                            en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));
    DDL_ASSERT(IS_VALID_HW_CTRL_EVENTS(u32CondSrc));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Enable == enNewState)
    {
        SET_REG32_BIT(TMR6x->HCLRR, u32CondSrc);
    }
    else
    {
        CLEAR_REG32_BIT(TMR6x->HCLRR, u32CondSrc);
    }
}

/**
 * @brief  Hardware clear condtion clear
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @retval None
 */
void TMR6_HwClrCondClr(M4_TMR6_TypeDef *TMR6x)
{
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));

    WRITE_REG32(TMR6x->HCLRR, 0UL);
}

/**
 * @brief  Hardware update condtion command
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @param  [in] u32CondSrc  Events source for hardware update, maybe one or any combination of the parameter
 *                          @ref TMR6_hardware_control_event_define
 * @param  [in] enNewState  The function new state
 *  @arg  This parameter can be: Enable or Disable
 * @retval None
 */
void TMR6_HwUpdCondCmd(M4_TMR6_TypeDef *TMR6x,
                            uint32_t u32CondSrc,
                            en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));
    DDL_ASSERT(IS_VALID_HW_CTRL_EVENTS(u32CondSrc));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Enable == enNewState)
    {
        SET_REG32_BIT(TMR6x->HUPDR, u32CondSrc);
    }
    else
    {
        CLEAR_REG32_BIT(TMR6x->HUPDR, u32CondSrc);
    }
}

/**
 * @brief  Hardware update conditon clear
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @retval None
 */
void TMR6_HwUpdCondClr(M4_TMR6_TypeDef *TMR6x)
{
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));

    WRITE_REG32(TMR6x->HUPDR, 0UL);
}

/**
 * @brief  Hardware capture condtion command for channel A
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @param  [in] u32CondSrc  Events source for hardware capture, maybe one or any combination of the parameter
 *                          @ref TMR6_hardware_control_event_define
 * @param  [in] enNewState  The function new state
 *  @arg  This parameter can be: Enable or Disable
 * @retval None
 */
void TMR6_HwCaptureChACondCmd(M4_TMR6_TypeDef *TMR6x,
                            uint32_t u32CondSrc,
                            en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));
    DDL_ASSERT(IS_VALID_HW_CTRL_EVENTS(u32CondSrc));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

