RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr6.c
    if (Enable == enNewState)
    {
        SET_REG32_BIT(TMR6x->HCPAR, u32CondSrc);
    }
    else
    {
        CLEAR_REG32_BIT(TMR6x->HCPAR, u32CondSrc);
    }
}

/**
 * @brief  Hardware capture condition clear for channel A
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @retval None
 */
void TMR6_HwCaptureChACondClr(M4_TMR6_TypeDef *TMR6x)
{
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));

    WRITE_REG32(TMR6x->HCPAR, 0UL);
}

/**
 * @brief  Hardware capture condtion command for channel B
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @param  [in] u32CondSrc  Events source for hardware capture, maybe one or any combination of the parameter
 *                          @ref TMR6_hardware_control_event_define
 * @param  [in] enNewState  The function new state
 *  @arg  This parameter can be: Enable or Disable
 * @retval None
 */
void TMR6_HwCaptureChBCondCmd(M4_TMR6_TypeDef *TMR6x,
                            uint32_t u32CondSrc,
                            en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));
    DDL_ASSERT(IS_VALID_HW_CTRL_EVENTS(u32CondSrc));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Enable == enNewState)
    {
        SET_REG32_BIT(TMR6x->HCPBR, u32CondSrc);
    }
    else
    {
        CLEAR_REG32_BIT(TMR6x->HCPBR, u32CondSrc);
    }
}

/**
 * @brief  Hardware capture condition clear for channel B
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @retval None
 */
void TMR6_HwCaptureChBCondClr(M4_TMR6_TypeDef *TMR6x)
{
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));

    WRITE_REG32(TMR6x->HCPBR, 0UL);
}

/**
 * @brief  Hardware increase conditon command
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @param  [in] u32CondSrc  Events source for hardware count, maybe one or any combination of the parameter
 *                          @ref TMR6_hardware_count_event_define
 * @param  [in] enNewState  The function new state
 *  @arg  This parameter can be: Enable or Disable
 * @retval None
 */
void TMR6_HwIncreaseCondCmd(M4_TMR6_TypeDef *TMR6x,
                            uint32_t u32CondSrc,
                            en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));
    DDL_ASSERT(IS_VALID_HW_CNT_EVENTS(u32CondSrc));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Enable == enNewState)
    {
        SET_REG32_BIT(TMR6x->HCUPR, u32CondSrc);
    }
    else
    {
        CLEAR_REG32_BIT(TMR6x->HCUPR, u32CondSrc);
    }
}

/**
 * @brief  Hardware increase condition clear
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3s
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @retval None
 */
void TMR6_HwIncreaseCondClr(M4_TMR6_TypeDef *TMR6x)
{
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));

    WRITE_REG32(TMR6x->HCUPR, 0UL);
}

/**
 * @brief  Hardware decrease condition command
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @param  [in] u32CondSrc  Events source for hardware count, maybe one or any combination of the parameter
 *                          @ref TMR6_hardware_count_event_define
 * @param  [in] enNewState  The function new state
 *  @arg  This parameter can be: Enable or Disable
 * @retval None
 */
void TMR6_HwDecreaseCondCmd(M4_TMR6_TypeDef *TMR6x,
                            uint32_t u32CondSrc,
                            en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));
    DDL_ASSERT(IS_VALID_HW_CNT_EVENTS(u32CondSrc));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Enable == enNewState)
    {
        SET_REG32_BIT(TMR6x->HCDOR, u32CondSrc);
    }
    else
    {
        CLEAR_REG32_BIT(TMR6x->HCDOR, u32CondSrc);
    }
}

/**
 * @brief  Hardware decrease condtion clear
 * @param  [in] TMR6x       Timer6 unit
 *  @arg M4_TMR6_1
 *  @arg M4_TMR6_2
 *  @arg M4_TMR6_3
 *  @arg M4_TMR6_4
 *  @arg M4_TMR6_5
 *  @arg M4_TMR6_6
 *  @arg M4_TMR6_7
 *  @arg M4_TMR6_8
 * @retval None
 */
void TMR6_HwDecreaseCondClr(M4_TMR6_TypeDef *TMR6x)
{
    DDL_ASSERT(IS_VALID_TMR6_UNIT(TMR6x));

    WRITE_REG32(TMR6x->HCDOR, 0UL);
}

/**
 * @brief  Timer6 Hardware trigger event configuration for(trigger0~trigger3)
 * @param  [in] u32TrigIndex    Timer6 Hardware trigger index
 *                              @ref TMR6_Hardware_Trigger_Index_define
 * @param  [in] enEvent         Event configuration for timer6 hardware trigger
 * @retval None
 */
void TMR6_SetTriggerSrc(uint32_t u32TrigIndex, en_event_src_t enEvent)
{
    DDL_ASSERT(IS_VALID_HW_TRIGGER_INDEX(u32TrigIndex));

    __IO uint32_t *TMR6_HTSSRx = (__IO uint32_t *)((uint32_t)&M4_AOS->TMR6_HTSSR1 +  4UL * u32TrigIndex);
    MODIFY_REG32(*TMR6_HTSSRx, AOS_TMR6_HTSSR_TRGSEL, enEvent);
}

/**
 * @brief  Timer6 Hardware trigger common event function command for(trigger0~trigger3)
 * @param  [in] u32TrigIndex        Timer6 Hardware trigger index
 *                                  @ref TMR6_Hardware_Trigger_Index_define
 * @param  [in] u32ComTrig          Common trigger event enable.
 *                                  This parameter can be one of the following values:
 *   @arg  TMR6_COM_TRIG1: Common trigger event 1.
 *   @arg  TMR6_COM_TRIG2: Common trigger event 2.
 * @param  [in] enNewState          New state of common trigger function.
 * @retval none
 */
void TMR6_ComTriggerCmd(uint32_t u32TrigIndex, uint32_t u32ComTrig, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_HW_TRIGGER_INDEX(u32TrigIndex));
    DDL_ASSERT(IS_VALID_TMR6_COM_TRIG(u32ComTrig));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

