RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr6.c
    __IO uint32_t *TMR6_HTSSRx = (__IO uint32_t *)((uint32_t)&M4_AOS->TMR6_HTSSR1 +  4UL * u32TrigIndex);

    if (Enable == enNewState)
    {
        SET_REG32_BIT(*TMR6_HTSSRx, u32ComTrig);
    }
    else
    {
        CLEAR_REG32_BIT(*TMR6_HTSSRx, u32ComTrig);
    }
}

/**
 * @brief  Set the fields of structure stc_tmr6_basecnt_cfg_t to default values
 * @param  [out] pstcInit           Pointer to a @ref stc_tmr6_basecnt_cfg_t structure
 * @retval An en_result_t enumeration value.
 *  @arg Ok:                        Successfully done
 *  @arg ErrorInvalidParameter:     Parameter error
 */
en_result_t TMR6_BaseCntStructInit(stc_tmr6_basecnt_cfg_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->u32CntMode = TMR6_MODE_SAWTOOTH;
        pstcInit->u32CntDir = TMR6_CNT_INCREASE;
        pstcInit->u32CntClkDiv = TMR6_CLK_PCLK0_DIV1;
        pstcInit->u32CntStpAftOvf = TMR6_CNT_CONTINUOUS;
        enRet = Ok;
    }
    return enRet;
}

/**
 * @brief  Set the fields of structure stc_tmr6_buf_func_cfg_t to default values
 * @param  [out] pstcInit           Pointer to a @ref stc_tmr6_buf_func_cfg_t structure
 * @retval An en_result_t enumeration value.
 *  @arg Ok:                        Successfully done
 *  @arg ErrorInvalidParameter:     Parameter error
 */
en_result_t TMR6_BufFuncStructInit(stc_tmr6_buf_func_cfg_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->u32BufFunCmd = TMR6_BUF_FUNC_OFF;
        pstcInit->u32BufNum = TMR6_BUF_FUNC_SINGLE;
        pstcInit->u32BufTransTim = TMR6_BUF_TRANS_TIM_NONE;

        enRet = Ok;
    }
    return enRet;
}

/**
 * @brief  Set the fields of structure stc_tmr6_valid_period_func_cfg_t to default values
 * @param  [out] pstcInit           Pointer to a @ref stc_tmr6_valid_period_func_cfg_t structure
 * @retval An en_result_t enumeration value.
 *  @arg Ok:                        Successfully done
 *  @arg ErrorInvalidParameter:     Parameter error
 */
en_result_t TMR6_ValidPeriodStructInit(stc_tmr6_valid_period_func_cfg_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->u32StatChA = TMR6_VALID_PERIOD_FUNC_CHA_OFF;
        pstcInit->u32StatChB = TMR6_VALID_PERIOD_FUNC_CHB_OFF;
        pstcInit->u32CntCond = TMR6_VALID_PERIOD_FUNC_OFF;
        pstcInit->u32PeriodInterval = TMR6_VALID_PERIOD_CNT_INVALID;

        enRet = Ok;
    }
    return enRet;
}

/**
 * @brief  Set the fields of structure stc_tmr6_port_input_cfg_t to default values
 * @param  [out] pstcInit           Pointer to a @ref stc_tmr6_port_input_cfg_t structure
 * @retval An en_result_t enumeration value.
 *  @arg Ok:                        Successfully done
 *  @arg ErrorInvalidParameter:     Parameter error
 */
en_result_t TMR6_PortInputStructInit(stc_tmr6_port_input_cfg_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->u32PortMode = TMR6_PORT_CAPTURE_INPUT;
        pstcInit->u32FilterSta = TMR6_PORT_INPUT_FILTER_OFF;
        pstcInit->u32FltClk = TMR6_INPUT_FILTER_PCLK0_DIV1;

        enRet = Ok;
    }
    return enRet;
}

/**
 * @brief  Set the fields of structure stc_tmr6_port_output_cfg_t to default values
 * @param  [out] pstcInit           Pointer to a @ref stc_tmr6_port_output_cfg_t structure
 * @retval An en_result_t enumeration value.
 *  @arg Ok:                        Successfully done
 *  @arg ErrorInvalidParameter:     Parameter error
 */
en_result_t TMR6_PortOutputStructInit(stc_tmr6_port_output_cfg_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->u32PortMode = TMR6_PORT_COMPARE_OUTPUT;
        pstcInit->u32NextPeriodForceSta = TMR6_PORT_OUTPUT_STA_LOW;
        pstcInit->u32DownCntMatchAnotherCmpRegSta = TMR6_PORT_OUTPUT_STA_LOW;
        pstcInit->u32UpCntMatchAnotherCmpRegSta = TMR6_PORT_OUTPUT_STA_LOW;
        pstcInit->u32DownCntMatchCmpRegSta = TMR6_PORT_OUTPUT_STA_LOW;
        pstcInit->u32UpCntMatchCmpRegSta = TMR6_PORT_OUTPUT_STA_LOW;
        pstcInit->u32UnderflowSta = TMR6_PORT_OUTPUT_STA_LOW;
        pstcInit->u32OverflowSta = TMR6_PORT_OUTPUT_STA_LOW;
        pstcInit->u32StopSta = TMR6_PORT_OUTPUT_STA_LOW;
        pstcInit->u32StartSta = TMR6_PORT_OUTPUT_STA_LOW;

        enRet = Ok;
    }
    return enRet;
}

/**
 * @brief  Set the fields of structure stc_tmr6_emb_cfg_t to default values
 * @param  [out] pstcInit           Pointer to a @ref stc_tmr6_emb_cfg_t structure
 * @retval An en_result_t enumeration value.
 *  @arg Ok:                        Successfully done
 *  @arg ErrorInvalidParameter:     Parameter error
 */
en_result_t TMR6_EMBCfgStructInit(stc_tmr6_emb_cfg_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->u32ValidCh = TMR6_EMB_EVENT_VALID_CH0;
        pstcInit->u32ReleaseMode = TMR6_EMB_RELEASE_IMMEDIATE;
        pstcInit->u32PortSta = TMR6_EMB_PORTSTA_NORMAL;

        enRet = Ok;
    }
    return enRet;
}

/**
 * @brief  Set the fields of structure stc_tmr6_deadtime_cfg_t to default values
 * @param  [out] pstcInit           Pointer to a @ref stc_tmr6_deadtime_cfg_t structure
 * @retval An en_result_t enumeration value.
 *  @arg Ok:                        Successfully done
 *  @arg ErrorInvalidParameter:     Parameter error
 */
en_result_t TMR6_DeadTimeCfgStructInit(stc_tmr6_deadtime_cfg_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->u32DtEqualUpDwn = TMR6_DEADTIME_EQUAL_OFF;
        pstcInit->u32EnDtBufUp = TMR6_DEADTIME_CNT_UP_BUF_OFF;
        pstcInit->u32EnDtBufDwn = TMR6_DEADTIME_CNT_DOWN_BUF_OFF;

        enRet = Ok;
    }
    return enRet;
}

/**
 * @brief  Set the fields of structure stc_tmr6_zmask_cfg_t to default values
 * @param  [out] pstcInit               Pointer to a @ref stc_tmr6_zmask_cfg_t structure
 * @retval An en_result_t enumeration value.
 *  @arg Ok:                            Successfully done
 *  @arg ErrorInvalidParameter:         Parameter error
 */
en_result_t TMR6_ZMaskCfgStructInit(stc_tmr6_zmask_cfg_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->u32ZMaskCycle = TMR6_ZMASK_CYCLE_FUNC_INVALID;
        pstcInit->u32PosCntMaskEn = TMR6_POS_CLR_ZMASK_FUNC_INVALID;
        pstcInit->u32RevCntMaskEn = TMR6_REVO_CNT_ZMASK_FUNC_INVALID;

        enRet = Ok;
    }
    return enRet;
}
/**
 * @}
 */

#endif /* DDL_TMR6_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
